# Integer Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
SpecTypeId..::..Int..::..Integer Property
SpecTypeId..::..Int Class See Also
---
Integer, in discipline Common.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId Integer { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property Integer As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ Integer {
	ForgeTypeId^ get ();
}
```

# See Also
SpecTypeId..::..Int Class
Autodesk.Revit.DB Namespace